AccumulationRegisters/Остатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>Остатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonForms/ФормаПодбора/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиОстатки.Склад КАК Склад,
		|	ОстаткиОстатки.НомерПартии КАК НомерПартии,
		|	ОстаткиОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиОстатки.ДатаВыпуска КАК ДатаВыпуска
		|ИЗ
		|	РегистрНакопления.Остатки.Остатки(&Дата, ) КАК ОстаткиОстатки
		|ГДЕ
		|	ОстаткиОстатки.Номенклатура = &Номенклатура
		|	И ОстаткиОстатки.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Номенклатура", Параметры.ОстНоменклатура);
	Запрос.УстановитьПараметр("Дата", Параметры.ОстДата);
	Запрос.УстановитьПараметр("Склад", Параметры.ОстСклад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТО = ТаблицаОстатков.Добавить();
		СтрокаТО.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		СтрокаТО.Склад = ВыборкаДетальныеЗаписи.Склад;
		СтрокаТО.НомерПартии = ВыборкаДетальныеЗаписи.НомерПартии;
		СтрокаТО.Остаток = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		СтрокаТО.ДатаВыпускаПартии = ВыборкаДетальныеЗаписи.ДатаВыпуска;
	КонецЦикла;
	
	ТаблицаОстатков.Сортировать("ДатаВыпускаПартии Убыв");
	
КонецФункции

&НаКлиенте
Функция ТаблицаОстатковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СЗ = Новый СписокЗначений;
	СЗ.Добавить(Элемент.ТекущиеДанные.Номенклатура);
	СЗ.Добавить(Элемент.ТекущиеДанные.Склад);
	СЗ.Добавить(Элемент.ТекущиеДанные.НомерПартии);
	СЗ.Добавить(Элемент.ТекущиеДанные.Остаток);
	СЗ.Добавить(Элемент.ТекущиеДанные.ДатаВыпускаПартии);
	Закрыть(СЗ);
КонецФункции

#КонецОбласти
